/* Error message string. The first %@ is the file name, the second the error message */
"Could not extract the file \"%@\": %@" = "Extraction du fichier \"%1$@\" impossible: %2$@";

/* Error message for resource forks. The first %@ is the file name, the second the error message */
"Could not extract the resource fork for the file \"%@\":\n%@" = "Extraction du Resource Fork du fichier \"%1$@\" impossible :\n%2$@";

/* Option in the encoding pop-up to detect the encoding automatically */
"Detect automatically" = "Détecter automatiquement";

/* Panel OK button title when choosing an unarchiving destination for an archive */
"Extract" = "Extraire";

/* Panel title when choosing an unarchiving destination for an archive */
"Extract Archive" = "Extraire l'archive";

/* Status text while extracting an archive */
"Extracting \"%@\"" = "Extraction de \"%@\"";

/* Status text when preparing to extract an archive */
"Preparing to extract \"%@\"" = "Extraction de \"%@\" en préparation";

/* Panel OK button title when choosing a default unarchiving destination */
"Select" = "Choisir";

/* Error message for files not extractable by The Unarchiver */
"The contents of the file \"%@\" can not be extracted with this program." = "contenu du fichier \"%@\" ne peut être extrait avec ce programme.";

/* Error messages from XADMaster.framework. Some are converted to friendlier messages in English, too. */

/* Common errors */
"Input data buffers border exceeded" = "L'archive est incomplète";
"Opening file failed" = "L'ouverture du fichier a échoué";
"Missing or wrong password" = "Mot de passe manquant ou erroné";
"Wrong checksum" = "L'archive est corrumpue";
"Could not create directory" = "La création du dossier a échoué";

/* Uncommon or unused errors */
"Unknown error" = "Erreur inconnue";
"Output data buffers border exceeded" = "L'extraction a échoué";
"Function called with illegal parameters" = "Fonction appelée avec des paramètres illégaux";
"Not enough memory available" = "Mémoire disponible insuffisante";
"Data is corrupted" = "Données corrompues";
"Command is not supported" = "Commande non supportée";
"Required resource missing" = "Ressource manquante";
"Error on decrunching" = "Une erreur est survenue lors de la décompression";
"Unknown file type" = "Type de fichier inconnu";
"File, disk has been skipped" = "Fichier, le disque a été ignoré";
"User break in progress hook" = "Processus interrompu par l'utilisateur";
"File already exists" = "Le fichier existe déjà";
"Verify failed (disk hook)" = "La vérification a échoué (disk hook)";
"Wrong drive geometry" = "Géométrie du disque erronée";
"Unknown data format" = "Format de données inconnu";
"Source contains no files" = "La source ne contient aucun fichier";
"Unknown filesystem" = "Système de fichier inconnu";
"Name of file exists as directory" = "Le nom du fichier existe déjà en tant que dossier";
"Buffer was too short" = "L'extraction a échoué";
"Text encoding was defective" = "L'encodage du texte était défectueux";
